c5/src/Catalogs/Books/Books.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Books</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <attributes>
    <name>CreationDate</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Creator</name>
    <type>
      <types>CatalogRef.Users</types>
    </type>
  </attributes>
  <attributes>
    <name>Link</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ManualSorting</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Sorting</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>SpecialAccess</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Dictionary</name>
    <attributes>
      <name>ID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Text</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

c5/src/InformationRegisters/GroupsAccessBooks/GroupsAccessBooks.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>GroupsAccessBooks</name>
  <resources>
    <name>Read</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Write</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>UserGroup</name>
    <type>
      <types>CatalogRef.UserGroupsDocuments</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Book</name>
    <type>
      <types>CatalogRef.Books</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

c5/src/InformationRegisters/UsersAndGroupsDocuments/UsersAndGroupsDocuments.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>UsersAndGroupsDocuments</name>
  <dimensions>
    <name>UserGroup</name>
    <comment>Нельзя использовать имя Group</comment>
    <type>
      <types>CatalogRef.UserGroupsDocuments</types>
    </type>
  </dimensions>
  <dimensions>
    <name>User</name>
    <type>
      <types>CatalogRef.Users</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

c5/src/InformationRegisters/EffectiveRights/EffectiveRights.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>EffectiveRights</name>
  <resources>
    <name>AccessBook</name>
    <type>
      <types>CatalogRef.Books</types>
    </type>
  </resources>
  <dimensions>
    <name>Book</name>
    <type>
      <types>CatalogRef.Books</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

c5/src/Catalogs/Books/ManagerModule.bsl
#if ( Server or ThickClientOrdinaryApplication or ExternalConnection ) then

Function GetSorting () export
	
	return Int ( CurrentUniversalDateInMilliseconds () / 1000 ) - 63545040000;
	
EndFunction 

Function CanChange ( Book ) export
	
	if ( Logins.Admin () ) then
		return true;
	endif; 
	s = "
	|select top 1 1
	|where &Ref in (
	|	select &Ref
	|	from InformationRegister.GroupsAccessBooks as GroupsAccess
	|		//
	|		// Groups
	|		//
	|		join InformationRegister.UsersAndGroupsDocuments as Groups
	|		on Groups.UserGroup = GroupsAccess.UserGroup
	|		and Groups.User = &CurrentUser
	|	where GroupsAccess.Write
	|	and GroupsAccess.Book in ( select AccessBook from InformationRegister.EffectiveRights where Book = &Ref )
	|	union
	|	select &Ref
	|	from InformationRegister.UsersAccessBooks as UsersAccess
	|	where UsersAccess.User = &CurrentUser
	|	and UsersAccess.Book in ( select AccessBook from InformationRegister.EffectiveRights where Book = &Ref )
	|	and UsersAccess.Write
	|	union
	|	select &Ref
	|	from InformationRegister.GroupsAccessBooks as GroupsAccess
	|	where GroupsAccess.UserGroup = value ( Catalog.UserGroupsDocuments.Everybody )
	|	and GroupsAccess.Book in ( select AccessBook from InformationRegister.EffectiveRights where Book = &Ref )
	|	and GroupsAccess.Write )
	|";
	q = new Query ( s );
	q.SetParameter ( "Ref", Book );
	q.SetParameter ( "CurrentUser", SessionParameters.User );
	return q.Execute ().Select ().Next ();
	
EndFunction 

#endif
